# Breaking it into steps with Subqueries

### Introduction

Subqueries allows us to create temporary tables that we can then reference later in our query.

### Loading our Data

In [3]:
import sqlite3
conn = sqlite3.connect('schools.db')

In [4]:
import pandas as pd
tuitions_df = pd.read_csv('./school_prices/tuition_income.csv')

In [10]:
salary_potential_df = pd.read_csv('./school_prices/salary_potential.csv')

In [6]:
tuitions_df.to_sql('tuitions', conn)

In [12]:
salary_potential_df.to_sql('salaries', conn)

### Exploring our Data

Now in the dataset above, we both have both salaries and tuition data for various colleges.  Let's say that we want to join together our `salaries` and `tuitions` table so that we can see the colleges that offer the highest return on investment.

And then let's take a look at some of the tuition data.

In [17]:
df = pd.read_sql("SELECT * FROM tuitions ORDER BY name ASC", conn)

df[:7]

,index,name,state,total_price,year,campus,net_cost,income_lvl
0,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"
1,181034,AI Miami International University of Art and D...,FL,33319,2011,On Campus,24365.0,"30,001 to 48,000"
2,181035,AI Miami International University of Art and D...,FL,33319,2011,On Campus,27254.0,"48_001 to 75,000"
3,181036,AI Miami International University of Art and D...,FL,33319,2011,On Campus,27329.0,"75,001 to 110,000"
4,181037,AI Miami International University of Art and D...,FL,33319,2011,On Campus,28785.0,"Over 110,000"
5,181038,AI Miami International University of Art and D...,FL,33611,2012,On Campus,24350.0,"0 to 30,000"
6,181039,AI Miami International University of Art and D...,FL,33611,2012,On Campus,25229.0,"30,001 to 48,000"

Now one thing that we'll notice is that while there only appears to record per school in the `salaries` table, there are multiple records per school in the `tuitions` table.  One way to join these tables together is by first reducing the tuitions table so there is also one record per school. 

Looking at the data, we see there are different average tuitions per year based on each income bracket.  Let's group these together.

In [20]:
df = pd.read_sql("SELECT * FROM tuitions GROUP BY name, year", conn)

In [23]:
df.to_sql('school_grouped_tuitions', conn)

In [26]:
pd.read_sql("SELECT * FROM school_grouped_tuitions", conn)[:2]

,level_0,index,name,state,total_price,year,campus,net_cost,income_lvl
0,0,181068,AI Miami International University of Art and D...,FL,37464,2010,Off Campus,25935.0,"0 to 30,000"
1,1,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"

Now let's say that we only want to view the most recent record for each school.

In [31]:
df = pd.read_sql("SELECT name, total_price as average_price, max(year) as year FROM school_grouped_tuitions GROUP BY name", conn)

In [32]:
df[:2]

                                                name  average_price  year
0  AI Miami International University of Art and D...          35514  2017
1                                        ASA College          33460  2018

Now above, we performed this in two steps, by first calculating the average cost per school, per year in a table called `school_grouped_tuitions`.  We then referenced that table to find the average_price for the most recent school school per year.  It turns out that with subqueries we can perform each of these steps in a single statement.  Here's how.

### Writing Subqueries

We again start with the query that groups by our tuition data by name and year.

```sql
SELECT * FROM tuitions GROUP BY name, year
```

In [33]:
tuitions_df = pd.read_sql("SELECT * FROM tuitions GROUP BY name, year", conn)
tuitions_df[:2]

,index,name,state,total_price,year,campus,net_cost,income_lvl
0,181068,AI Miami International University of Art and D...,FL,37464,2010,Off Campus,25935.0,"0 to 30,000"
1,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"

And we can then reference these results by first wrapping the query in parentheses, using the `as` keyword to assign an alias, and then referencing that subquery.

```sql
SELECT * FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
```

In [35]:
tuitions_df = pd.read_sql("""
SELECT * FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
""", conn)

tuitions_df[:2]

,index,name,state,total_price,year,campus,net_cost,income_lvl
0,181068,AI Miami International University of Art and D...,FL,37464,2010,Off Campus,25935.0,"0 to 30,000"
1,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"

So notice in the above, we reference the result of the subquery as if it were a table itself.  In the query above, we simply return all of the results of the subquery.  This time, let's use the derived table to return only a single row per school.

In [37]:
sql = """SELECT name, total_price as average_price, max(year) as year FROM 
(SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions
GROUP BY name"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                                name  average_price  year
0  AI Miami International University of Art and D...          35514  2017
1                                        ASA College          33460  2018

Let's see this in cleaner syntax.

```sql 
SELECT name, total_price as average_price, max(year) as year FROM 
(SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions
GROUP BY name
```

So in the outer SELECT statement we select from the subquery -- or the derived table.  Notice also that the subquery itself is a valid select statement.

### Deeper on the Derived Table

We really should treat the derived table just like a table in SQL.  For example, if we select certain columns in the subquery, only these columns are can be referenced when selecting from the derived table.

In [41]:
sql = """SELECT college, average_price, max(year) as year FROM 
(SELECT name as college, total_price as average_price, year, net_cost FROM tuitions GROUP BY name, year)
as school_grouped_tuitions
GROUP BY college"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                             college  average_price  year
0  AI Miami International University of Art and D...          35514  2017
1                                        ASA College          33460  2018

So notice that this time in the subequery we only selected the `name`, `total_price`, `year` and `net_cost` columns, aliasing `name` as college and total_price as average_price.  And then we selected referenced these columns of the derived table  -- college, average_price and year.

### Subqueries all the way down

So remember that our pattern for using a subquery is simply to write a select statement and wrap it in parentheses and assign an alias.

```sql 
(SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions
```

If want, we can also turn our query above into a subquery by following the same pattern:

> So we start with the following query:

```sql
SELECT college, average_price, max(year) as year FROM 

    (SELECT name as college, total_price as average_price, year, net_cost FROM tuitions GROUP BY name, year)
    as school_grouped_tuitions
GROUP BY college
```

And then turn it into a subquery by wrapping the whole thing in parentheses and specifying an alias.

```sql
SELECT * FROM
    (SELECT college, average_price, max(year) as year FROM 
        (SELECT name as college, total_price as average_price, year, net_cost 
         FROM tuitions GROUP BY name, year)
        as school_grouped_tuitions
        GROUP BY college)
        as tuitions
```

Below we show the result.

In [43]:
sql = """SELECT * FROM (SELECT college, average_price, max(year) as year FROM 
(SELECT name as college, total_price as average_price, year, net_cost FROM tuitions GROUP BY name, year)
as school_grouped_tuitions
GROUP BY college) as tuitions"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                             college  average_price  year
0  AI Miami International University of Art and D...          35514  2017
1                                        ASA College          33460  2018

### Summary

Subqueries allow us to create to treat the result of a SELECT statement as a derived table.  Doing so allows us to break our SQL calculations into steps.

Above, we started with our select statement of:

```
SELECT * FROM tuitions GROUP BY name, year
```
And then turned it into a subquery by wrapping it in parentheses and setting the result to an alias.  Notice that the outer query is now selecting from the result of the subquery, `school_grouped_tuitions`.

```sql
SELECT * FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
```

In [44]:
tuitions_df = pd.read_sql("""
SELECT * FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
""", conn)

tuitions_df[:2]

,index,name,state,total_price,year,campus,net_cost,income_lvl
0,181068,AI Miami International University of Art and D...,FL,37464,2010,Off Campus,25935.0,"0 to 30,000"
1,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"

So our subquery resulted in records grouped by school and year.  And then we used we further grouped these results so we only see the most recent record per year.

```sql
SELECT college, average_price, max(year) as year FROM 
    (SELECT name as college, total_price as average_price, year, net_cost FROM tuitions 
     GROUP BY name, year) as school_grouped_tuitions
GROUP BY college
```

In [45]:
sql = """SELECT * FROM (SELECT college, average_price, max(year) as year FROM 
(SELECT name as college, total_price as average_price, year, net_cost FROM tuitions GROUP BY name, year)
as school_grouped_tuitions
GROUP BY college) as tuitions"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                             college  average_price  year
0  AI Miami International University of Art and D...          35514  2017
1                                        ASA College          33460  2018